Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: How do you know that, sir?
jbo: seja'e ma do djuno ra doi sir

source: The exact date is 1742.
jbo: se ke satci detri lo nanca be li pazevore

source: Doctor Mortimer pulled it out of his breast-pocket.
jbo: la mortimer poi mikce pu lacpu ta to'o lo me vo'a cutne daski

source: He died three months ago in Devonshire.
jbo: co'a morsi bu'u la devoncir de'i li vu'u pi'e pi'e ci

source: He was an intelligent and practical man.
jbo: ko'a pu stati je certu remna

source: However, he treated this document seriously.
jbo: ku'i ko'a pu junri tu'a le vi te tcidu

source: It seems to be his statement.
jbo: za'a ti me ta jufra

source: Yes, it is the statement of a certain legend of the Baskerville family.
jbo: .ie ti jufra lo zasti ranmi be lo me la baskervil lanzu

source: Do you come?
jbo: .aipei do klama

source: He does not say.
jbo: na cusku

source: Did you speak?
jbo: xu do pu tavla

source: They did not enter.
jbo: za'u ta pu na klama lo nenri

source: The doctor pulled the paper from his pocket.
jbo: lo mikce pu lacpu lo papri to'o lo me ta daski

source: She gave the dog to her friends.
jbo: pu te cpacu lo gerku za'u me ta pendo

source: The old person died in their room.
jbo: lo laldo prenu pu co'a morsi bu'u lo me za'u ta kumfa

source: I entered her room.
jbo: mi pu klama lo nenri be lo me ta kumfa

source: He showed the forgery to my friends.
jbo: pu jarco tu'a lo palci fukpi za'u me mi pendo

source: She often spoke about our curse.
jbo: pu di'i tavla fi lo nu te dapma be mi'ai

source: Why did you come to see me today?
jbo: ma krinu lo nu do ca lo cabdei ku penmi mi

source: I want to learn.
jbo: .au mi cilre

source: I am loved by my mother.
jbo: mi se prami lo me mi mamta

source: No problem, I understand.
jbo: .i na nabmi .i mi jimpe

source: I'm playing SpaceChem.
jbo: mi kelci la'oi SpaceChem

source: He just needs a helmet.
jbo: ko'a nitcu lo mapku

source: My name is Tom.
jbo: mi se cmene la .tom.

source: I can't speak Tok Pisin well.
jbo: la .tokpisin. no'e bangu mi

source: Enough of all this talking!
jbo: banzu fa lo dei nu tavla

source: Don't touch me!
jbo: ko na pencu mi

source: I'll call the police.
jbo: mi ba fonxa tavla lo pulji tcana

source: Stop! Thief!
jbo: ko sisti .i zekri lebna

source: It's an emergency.
jbo: ka se traji tcini

source: We hate violence.
jbo: mi'a xebni lo vlile

source: Tell me why you were absent from school yesterday.
jbo: ko jungau mi lo du'u mu'i ma do pu nalzvati lo ckule ca lo prulamdei

source: Tom hopes you're happy.
jbo: la .tam. pacna lo nu do gleki

source: I'm certain.
jbo: mi birti

source: That dog jumped.
jbo: lo va gerku pu plipe

source: Hurry!
jbo: ko sutra

source: I'm glad to be back.
jbo: ui mi mo'u xruti

source: I took off my sweater because it got warmer.
jbo: .i mi kosta dasni sisti mu'i lo nu glare zenba

source: It's a terrible climate.
jbo: xlali timvanbi

source: My toe started bleeding.
jbo: lo mi jmadegji co'a blucri

source: These shoes belong to me.
jbo: ti poi cutci ku'o mi se ralte

source: I saw Yumi in my dream.
jbo: mi viska la .iumis. ca'o lo mi nu senva

source: I dreamed about Yumi.
jbo: mi la .iumis. cu senva

source: Can you pass me the milk?
jbo: pa'u benji loi ladru mi

source: The days are dragging slowly by.
jbo: lo djedi ca'o masno .oi prubi'o

source: Now the story is over.
jbo: nau lo nu cusku lo lisri cu mulno

source: Maria's hair is long.
jbo: loi kerfa be la .marias. cu clani

source: It's not necessary to come tomorrow.
jbo: .einaidai klama ca lo bavlamdei

source: Please don't take pictures here.
jbo: pe'u na vi kacmyterxra

source: The sporks are still in the dishwasher?
jbo: .ianai loi mucyjoifro le paltylumca'a cu za'o nenri

source: Which subject do you like the most?
jbo: do ma nelrai lo'i seltadni

source: I like listening to classical music a lot.
jbo: mi nelci lo nu ta'e tinju'i lo nolzgi

source: Could this be the start of something big?
jbo: ru'a ti krasi lo vajni

source: Iceland was fantastic.
jbo: la islant pu se manci

source: I'm not a doctor.
jbo: mi na mikce

source: I love my job.
jbo: mi nelci lo jibri be mi

source: I love Tatoeba.
jbo: mi prami la'oi Tatoeba

source: The cook is sitting in the kitchen.
jbo: le jukpa cu zutse ne'i le jupku'a

source: You had read.
jbo: do pu tcidu

source: War is the poison of the world.
jbo: lo nu jamna cu vindu le terdi

source: How much time before dinner?
jbo: ma temci fi le nunvacysai

source: Your mamma's so fat, she'd break London Bridge.
jbo: lo za'i lo do mamta cu tcetce plana cu rinka lo nu porpi lo la .lyndyn. cripu

source: They're all talking about his death.
jbo: ro ko'a tavla fi lo nu ko'e mrobi'o

source: Have fun on your trip!
jbo: .a'o lenu do klama cu zdile ko

source: I want to watch this film.
jbo: .au mi mencti ti skina

source: Thomas likes Anna, but Anna doesn't like Thomas.
jbo: la .tomas. cu prami la .anas. .ije ri na prami ra

source: I don't love you.
jbo: mi na'e prami do

source: I hope I can talk in Lojban.
jbo: mi .a'o tavla bau la .lojban.

source: I'm also thinking to go to Beijing.
jbo: mi si'a pensi lo ka klama la .beijin.

source: Please drink tea.
jbo: .e'o do pinxe lo tcati

source: Please sit down!
jbo: .e'o do zutse

source: We helped him financially.
jbo: mi'a pu rupsra sidju ko'a

source: Make it a little louder.
jbo: gau ko cladu ke cmalu zmadu

source: She's now straightening up her room.
jbo: .i ca sipku'a nicygau

source: Huizi asked Zhuangzi: "If you're not a fish, how do you know what fish enjoy?"
jbo: la xueizis pu reisku fi lo djuanzis fe "lu fau da'inai lo nu do finpe nai vau ta'i ma do facki lo nu fe makau fa lo finpe cu nelci li'u"

source: Please give me three of each kind.
jbo: .e'o ko dunda ci da pe ro se ckaji mi

source: I really want to go to Egypt.
jbo: .ausai mi klama la misrygu'e

source: You scare me.
jbo: mi do terpa

source: Where are your keys?
jbo: lo do ckiku ma zvati

source: The ball of the child fell into the creek.
jbo: lo bolci pe lo verba cu pu farlu ne'i lo cmari'e

source: I'm still alive.
jbo: mi za'o jmive

source: If a person has not had a chance to acquire his target language by the time he's an adult, he's unlikely to be able to reach native speaker level in that language.
jbo: fau lo nu da poi prenu cu nu'o se bangu de ba'o lo nu da makcu zo'u lakne nai fa lo nu da ba certu se bangu de

source: I need a new computer.
jbo: mi nitcu lo cnino skami

source: I plan to try reading some other books.
jbo: mi platu lo nu troci lo nu tcidu lo drata cukta

source: Greet god!
jbo: ko rinsa la cevni

source: You are a panda.
jbo: do cionmau

source: The answer is right.
jbo: drani danfu

source: Give it to me.
jbo: ko dunda ra mi

source: Those shoes were made in Italy.
jbo: lo va cutci cu se zbasu bu'u la Italias

source: Are they busy?
jbo: xu lo za'u ra tolcando

source: You're a bug.
jbo: do pe'a miptera

source: This is a wood table.
jbo: ti mudri jubme

source: I don't have a dog.
jbo: mi ralte no gerku

source: A crocodile has eaten Tom.
jbo: lo krokodilo ba'o citka la .tom.

source: Cats don't eat bananas.
jbo: lo'e mlatu ku na citka lo badna

source: Crocodiles have sharp teeth.
jbo: lo'e krokodilo ku se ke kinli denci

source: That's what I want to know.
jbo: .au mi djuno ta

source: If you are strong, I am strong.
jbo: va'o lo nu do tsali kei mi tsali

source: When do you think he'll be back?
jbo: ca ma sei do jinvi ra ba xruti

source: How many languages are there in Europe?
jbo: xo bangu lo ropno se zdani

source: I love watching birds.
jbo: mi nelci lo nu zgana lo cipni

source: I am thankful for music.
jbo: mi ckire fi tu'a lo zgike

source: Don't let them fool you.
jbo: .e'unai ko'a na tcica ko

source: I want some paper.
jbo: papri au

source: I'm 1.83 meters tall.
jbo: mi mitre li papibici

source: Ah! What a beautiful flower!
jbo: .ue melbi xrula

source: A cat has two ears.
jbo: lo'e mlatu ku se kerlo re da

source: An old man has a long gray beard.
jbo: lo tolci'o ku se xejykre lo clani je grusi

source: The entire colony will inherit the mutant DNA.
jbo: piro le cecmu cu ba cerda le binxo me dyny.abu

source: How do you do?
jbo: .i xu do kanro vau ro'i cu'i

source: We have no extra money.
jbo: mi na ponse lo dukse jdini

source: She's well known as a singer.
jbo: djuno lo du'u ko'a na'o sanga

source: You can't buy happiness.
jbo: sei na cumki do te vecnu lo ka gleki

source: Mike has two friends who are women.
jbo: la .maik. cu se pendo su'o re da poi ninmu

source: We eat so we may live.
jbo: mi citka tezu'e lonu mi jmive

source: Look at that short pretty girl.
jbo: ko catlu ta poi melbi je cmalu nixli

source: No one knows the reason.
jbo: no da djuno lo du'u makau krinu

source: Nobody knows why.
jbo: no da djuno lo du'u jalge makau

source: He was writing a letter while listening to music.
jbo: ko'a pu ciska lo xatra ca lo nu tirna lo zgike

source: That dog is really old!
jbo: lo ta gerku cu tcelaldo

source: What is done out of love always takes place beyond good and evil.
jbo: lo se mukti be lo nu prami cu bancu lo vrude jo'u lo palci

source: I heard you are going to get married.
jbo: ti'e do ba spebi'o

source: They worked like bees.
jbo: .i gunka fi'o pe'a simsa lo bifce

source: She has her father's eyes and her mother's nose.
jbo: ko'a se kanla zo'e pe lo patfu gi'e se nazbi zo'e pe lo mamta

source: I think that my head is not empty.
jbo: pe'i lo mi stedu cu nalkunti

source: Three times four is twelve.
jbo: li ci pi'i vo du li pare

source: I have a son and a daughter. He is in New York, and she is in London.
jbo: mi se bersa je se tixnu .i le bersa cu zvati la .nu,IOrk. .i le tixnu cu zvati la .lyndyn.

source: I want to speak in Lojban.
jbo: .au mi baupli la lojban.

source: Do you like New York?
jbo: xu do nelci la niu,iork.

source: Stop complaining!
jbo: .o'onai ko patsti

source: It seems classes began yesterday.
jbo: ti'e lenu ctuca cu purlamdei cfari

source: I'm an old man.
jbo: mi me lo laldo prenu

source: He's not sick.
jbo: ra na bilma

source: Sugar dissolves in hot water.
jbo: lo sakta cu runta lo glare djacu

source: That's Greek to me.
jbo: itkuile ga'a mi

source: The boy threw a stone.
jbo: lo nanla pu renro lo rokci

source: I'll wait until six o'clock.
jbo: mi denpa lo nu li xa cabytcika

source: Do you like trips?
jbo: xu do nelci lo nu litru

source: He received quite a few letters this morning.
jbo: ta pu cpacu mo'a xatra de'i li no ca lo cerni

source: What he said turned out to be a lie.
jbo: lo se cusku be ko'a te facki lo ka se ticysku

source: Father and brother.
jbo: patfu gije bruna

source: What are the lyrics to that song?
jbo: ma pemci ji'u lo ti se sanga

source: He's very angry.
jbo: ra mutce fengu

source: I can't think of a better way to celebrate my engagement to my best friend.
jbo: mi na kakne lo ka finti lo xauzma befi lo nu salci lo nu mi spenu'e lo xagrai pendo be mi

source: She's gonna kill me.
jbo: ko'a te mukti lo ka catra mi

source: I want to talk to him.
jbo: .au mi ko'a tavla

source: She's my wife.
jbo: ko'a fetsi speni mi

source: Are you trying to hit on me?
jbo: do mi cinju'i xu

source: I don't envy her.
jbo: mi na jilra ko'a

source: I don't know anyone by that name.
jbo: mi na'e djuno tu'a lo se cmene be ta

source: We would often discuss about our future.
jbo: mi'a pu simta'a le mi'a bavycu'i

source: Keep your hands off my daughter!
jbo: ko stogau lo be do xance lo ka nalpencu lo be mi tixnu

source: She likes all of us.
jbo: ko'a nelci ma'a

source: I will ask him tomorrow.
jbo: mi te preti fo ta de'i li pa

source: I like horses.
jbo: mi nelci lo xirma

source: Where can I find him?
jbo: zvati ma

source: Did you understand what he wanted to say?
jbo: pei do jimpe lo du'u ra djica lo ka cusku makau

source: We finally reached the top of the mountain.
jbo: mi'ai pu za'o mo'u tolcliva lo cmana jipno

source: I consider my driving skills to be above average.
jbo: pe'i lo nu mi kakne lo nu sazri lo karce cu zmadu ro so'i da

source: Obey your teachers.
jbo: ko tinbe fi lo do ctuca

source: I don't know how I did it. The important thing is that I did it.
jbo: sei na'e sanji lo tadji se'u vajni fa lo nu mi pu gasnu

source: He's so cute.
jbo: ko'a mutce citmle

source: The sky is big.
jbo: barda tsani

source: Why is it that guys who sleep around are studs and girls who sleep around are sluts?
jbo: ki'u ma lo nanmu poi sorgle cu xausorgle vau gi'e lo ninmu poi sorgle cu malsorgle

source: The end of the world is very near!
jbo: lo terdi bazi se daspo

source: English is the language of the world.
jbo: lo glibau cu terdi bangu

source: Are you a Buddhist?
jbo: xu do budjo

source: Are you a Taoist?
jbo: xu do dadjo

source: Are you an animist?
jbo: xu do me la animizm

source: Hello and bye! I'm Nonong.
jbo: coico'o i mi'e nonon

source: It's a new year.
jbo: cnino nanca

source: I'm looking forward to the summer vacation.
jbo: mi djicni lo ba crisa nalgundei

source: God blesses those who repent.
jbo: la cevni cu ruxyzau lo zerxe'u

source: I took my shoes off.
jbo: mi pu mo'u dasni lo me mi cutci

source: Please come. I really want to meet you.
jbo: e'o do klama ije mi je'a djica lo ka penmi do

source: Let's party!
jbo: .e'u mi'o salci

source: The person she's talking to is Allan.
jbo: lo prenu poi ko'a ca'o tavla ke'a me la .alyn.

source: I forbid you to leave.
jbo: .e'anai do cliva

source: We weren't told where he came from.
jbo: mi'a na te cusku lo du'u ko'a klama fi makau

source: Jack has no goals for his life.
jbo: la .djak. na se mivmu'i

source: He's my friend whose name is Jack.
jbo: ko'a mi pendo me'e zo djak.

source: I want to dance.
jbo: .au mi dansu

source: That's great!
jbo: .uidai

source: Stay here!
jbo: ko stali ti

source: You're nuts!
jbo: do ba'e fenki

source: She works a lot.
jbo: ra mutce gunka

source: You didn't need to bring your umbrella.
jbo: do pu na nitcu lo nu vizbei lo do santa

source: He went to the United States to study medicine.
jbo: pu klama lo gugde'usu mu'i lo nu tadni lo micysaske

source: He has gone to the United States.
jbo: ko'a lo mergu'e ba'o klama

source: Can you speak Toki Pona?
jbo: xu la .toki ponas. do bangu

source: My father has gone to the United States.
jbo: lo mi patfu pu klama lo mergu'e

source: I'm by the train station.
jbo: mi zvati vi le trenytcana

source: Any human can be a dead body.
jbo: ro remna ka'e mroxadni

source: Are you certain?
jbo: ju'opei

source: I want to eat.
jbo: .au mi citka

source: Will you go?
jbo: xu do ba klama

source: I don't want to listen to you.
jbo: .aunai mi zgatirna do

source: You're scaring me.
jbo: mi terpa do

source: Meg looks just like her mother.
jbo: la .meg. simsa le ri mamta

source: There was snow on the island of Lulus on January 14, 2012.
jbo: de'i li 2012 pi'e 01 pi'e 14 snime ne'i la lulus poi daplu

source: Laura is Brazillian.
jbo: la lauras cu brazo

source: Don't dress like a slut.
jbo: ko na dasni fi lo malsorgle

source: She is sitting on the bench.
jbo: ra zutse lo stizu

source: This sentence is not a translation. It's the original.
jbo: ti poi jufra na xe fanva .i ba'e se fanva

source: Dinosaur eggs? Impossible. These animals are already extinct.
jbo: dinsauru sovda xu .i na cumki .i lo bi'unai danlu ca morsi jutsi

source: We do what we must because we can.
jbo: .i zukte lo semu'igi se bilga gi se zifre

source: That new song is called "Lollipop".
jbo: le cnino selsa'a cu se cmene zo'oi Lollipop

source: I like turtles.
jbo: mi nelci lo cakyrespa

source: That's right, folks!
jbo: doi rodo je'ugo'i

source: Rats don't have nephews.
jbo: lo ratcu na famti

source: My pet is sick.
jbo: lo dalpe'o be mi cu bilma

source: The soldiers are dead.
jbo: le sonci ca morsi

source: Mary frequently has lucid dreams.
jbo: la .meris. di'i sajysne

source: We can't compete with Asia.
jbo: ma'a na kakne lo ka jivna lo xazdo

source: My brother is rich.
jbo: lo mi bruna cu ricfu

source: This is a lion.
jbo: ti cinfo

source: He is an aristocrat.
jbo: ko'a nobli

source: He promised me that he wouldn't tell anybody.
jbo: ra nupre lo nu ra na jungau da kei mi

source: I want to give Mom a plant.
jbo: .au mi dunda la mam. lo spati

source: I need someone to understand me.
jbo: mi nitcu da lo nu da jimpe mi

source: I'm curious.
jbo: mi kucli

source: It's up to you to decide whether we'll go there or not.
jbo: do pajni lo du'u xukau mi'ai ta ba klama

source: English is like a universal language.
jbo: la glibau cu simlu lo ka mujyku'e

source: You're working too hard. Take it easy for a while.
jbo: do gunka co mutce carmi i ko ze'i surla

source: Mary is weird.
jbo: la .meris. cizra

source: And you aint seen nothin yet.
jbo: ji'a do nu'o sai lifri

source: No matter how I try, I can't forget that kiss.
jbo: mi na tolmo'ika'e lo mu'e cinba ku ri'anai lo nu mi troci

source: I love my friends.
jbo: mi prami lo mi pendo

source: What should I do to save time?
jbo: ma xagrai fi lo ka tolpli lo temci

source: Why did he come here?
jbo: klama mu'i ma

source: I am confused.
jbo: mi se cfipu

source: No matter what I do, she says I can do better.
jbo: nalvajni fa ma kau poi mi gasnu .i ko'a cusku lu mi kakne lo nu xagmau gasnu li'u

source: I would have been surprised if the translation had been "I hate... " :)
jbo: puku mi se spaji lo du'u da'i xe fanva lo'u mi xebni li'o le'u vau zo'o

source: You have a beautiful name.
jbo: .i melbi cmene do

source: Hey you! What are you doing?
jbo: ju'i do .i do jai gau mo

source: She is crazy.
jbo: ko'a fenki prenu

source: I want to tell her the truth.
jbo: .au mi jungau ra lo fatci

source: I'm sleepy.
jbo: .au sipna

source: This hall is very big.
jbo: lo ti balku'a cu mutce barda

source: I am very happy in Georgia.
jbo: mi mutce gleki bu'u la georgias

source: It is not so.
jbo: na tai co'e

source: She's pregnant.
jbo: ko'a seltarbi

source: I think it's better not to try it.
jbo: pe'i xauzma fa lo nu na troci

source: Zhang looks confusedly.
jbo: la jan. se cfipu catlu

source: My blood group is A+.
jbo: lo ciblu be mi cu cmima abu ma'ubu

source: Physics is Greek to me.
jbo: lo termu'eske ku itkuile ga'a mi

source: You like coffee best.
jbo: do nelrai lo ckafi

source: You prefer coffee.
jbo: do nelrai lo ckafi

source: I can't remember how to do it.
jbo: mi na morji fi lo zukte tadji

source: The park is located in the center of the city.
jbo: le panka cu se stuzi lo centero be le tcadu

source: Whose camera is this?
jbo: ma ralte lo vi kacma

source: Have you ever visited Italy?
jbo: xu do pu su'oroi vitke la italias

source: Why are you still here?
jbo: mu'i ma do za'o zvati vi

source: Should I go?
jbo: eipei mi cliva

source: Your lips are red.
jbo: lo do ctebi cu xunre

source: I think it's necessary for you to see him.
jbo: mi pensi lo du'u do nitcu lo nu viska ko'a

source: It's extremely important to do sport every day.
jbo: mutce se vajni lonu di'i zukte lozu'o xadykelci'e

source: People are not remembered by the number of times they fail but for the number of times they succeed.
jbo: xokau lo nu lo remna cu fliba na krinu lo nu morji fi ry. i ku'i xokau lo nu ry. snada cu krinu

source: His long-haired, blond, Teddy Bear hamster was called Jabberwocky.
jbo: zo .djaberuakis. cmene le kriceto be la'o ly. Teddy Bear .ly. be'o dalpe'o be ko'a be'o noi clani je sloska se kerfa

source: I want to leave.
jbo: .au mi cliva

source: They plan to get married tomorrow.
jbo: ko'a zu'edji lo nu spebi'osi'u ca lo bavlamdei

source: Am I dreaming?
jbo: xu mi ca'o senva

source: It's a bit greasy.
jbo: grasu ke milxe ckaji

source: He lives alone in the woods.
jbo: ko'a pavysei selzda lo ricfoi

source: That is not true.
jbo: na jetnu

source: It is clear that there is no classification of the Universe that is not arbitrary and full of conjectures.
jbo: li'a klesi lo munje fa no da poi tolcmu joi sucysmadi

source: Jaded zombies acted quietly but kept driving their oxen forward.
jbo: lo cnifusra za'ojmidanlu cu pu smaci gi'e ki'a ca'o mo'i ca'u gidva lo vo'a bakni

source: Soccer is my favorite sport.
jbo: lo fudbolo ku esporte sei mi mutce lo ka nelci vo'a

source: Am I in London?
jbo: mi zvati la .london. xu

source: Do you like spicy food?
jbo: xu do nelci le crovu'i cidja

source: Would you still love me if I wasn't a werewolf?
jbo: xu lo nu do prami mi kei cu se fanmo va'o lo nu mi na remlabno

source: There is a cat on fire in my pants!
jbo: lo nu lo mlatu cu fagri kei cu nenri lo mi palku

source: I'm searching for friends here.
jbo: mi sisku tu'a za'u pendo vi ku

source: I'm going to the store.
jbo: mi klama le zarci

source: Tom likes money.
jbo: la tom cu nelci lo jdini

source: That is a very good thing.
jbo: ta mutce xamgu

source: I feel lonely.
jbo: mi cinmo lo ka nonkansa

source: It's done!
jbo: cai mo'u gasnu ti

source: We should leave.
jbo: .ei ma'a cliva

source: He's on the train.
jbo: ra nenri lo trene

source: I'm glad you brought this up.
jbo: mi gleki lo nu do mojgau fi la'edi'u

source: Do you want sugar?
jbo: xu do djica tu'a lo sakta

source: Is that French?
jbo: xu ta fraso

source: I want to study German.
jbo: .au mi bantadni lo bandu'e'u

source: My computer is my best friend.
jbo: lo mi skami fi mi pedrai

source: Tom is a priest.
jbo: la tom cu lijda catni

source: I have to return this book today.
jbo: .e'i mi xrugau ti poi cukta ca lo cabdei

source: I didn't ask Tom to go there.
jbo: mi na cpedu fi la tom fe lo nu klama da

source: Please ask Tom not to shout.
jbo: e'o ko cpedu fi la tom fe lo nu nalki'asku

source: Did you return Tom's book?
jbo: xu do pu xrugau lo la .tam. cukta

source: Tom has two children.
jbo: la tom se panzi re zo'e

source: The only thing you need to do is go there.
jbo: .ei po'o do klama ta

source: She didn't answer.
jbo: ko'a pu na dafsku

source: I need a good dictionary.
jbo: mi nitcu lo xamgu vlacku

source: I am pleased to see you.
jbo: mi se pluka lo nu viska do

source: Hi, Tom!
jbo: coi .tom.

source: Baby teeth are sharp.
jbo: lo denci be lo cifnu ku ku kinli

source: Where are the book and the pencil?
jbo: lo cukta ku .e lo pinsi ku zvati ma

source: Theodore owns the rose.
jbo: lo rozgu ku se ponse la .teodoros.

source: I talked about lions.
jbo: mi tavla fi lo cinfo

source: Japanese tourists can be found everywhere.
jbo: lo me la .nipon. datygugvi'e ku se penmi fe'eroroi

source: Hey cat, how are you? Are you sitting in the house? There are two cats.
jbo: coico'o mlatu i do mo i xu do zutse ne'i le zdani i lo mlatu cu remei

source: John's hand is clean.
jbo: le la .djan. xance cu jinsa

source: I only have one mouth, but I have two ears.
jbo: mi paroi se moklu gi'eku'i reroi se kerlo

source: I often read.
jbo: mi ta'e tcidu

source: Kid, don't touch the mirror!
jbo: doi verba ko na pencu le minra

source: I just want to hold her hand.
jbo: mi jgari be le xance ku djica

source: His son is a genius.
jbo: le ra bersa cu tcemencre

source: We can't put a young boy in prison.
jbo: .ainai pifygau le nanla

source: If you run into trouble, I'll help, and so will my father.
jbo: ca lo nu do se nabmi ku mi .e le mi patfu cu sidju

source: I love Natasha.
jbo: mi prami la .natacas.

source: That will be funny.
jbo: ta ba xajmi

source: To the bird, the dog exists.
jbo: le gerku cu zasti le cipni

source: Hope dies last.
jbo: lo nu pacna co'u zasti co romoi

source: You don't work in an office.
jbo: do na gunka bu'u lo briju

source: I have no time for games.
jbo: mi dukse lo ka tolcando ku lo nu kelci

source: He is still grappling with religious beliefs.
jbo: ko'a za'o damba lo terjda

source: I hate working.
jbo: mi xebni lo ka gunka

source: What he said is false.
jbo: le pu se cusku be ko'a cu jitfa da'inai

source: I read some books.
jbo: mi tcidu fi lo za'u cukta

source: I want a pet tiger.
jbo: mi djica tu'a lo dalpe'o tirxu
